InformationRegisters/ЛогиОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЛогиОшибок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Даннные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияКофигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияПрограммы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияОС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Процессор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперативнаяПамять</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>user_id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КритерииОшибок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КритерииОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КритерииОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКритичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Критическая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЛогиОшибок/Ext/ManagerModule.bsl
Процедура ЗаписатьОшибкуВЛоги(ТекстОшибки, СтруктураДанных = Неопределено, ОтправитьНаСервер = Истина, Важность = Неопределено) Экспорт
	Попытка
		Если НЕ ЗначениеЗаполнено(СтруктураДанных) Тогда
			СтруктураДанных = ПодготовитьИнформацибОбОшибке(ТекстОшибки,, Важность); 
		КонецЕсли;
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураДанных);
		
		МенеджерЗаписи.Записать(Ложь);
		
		Если ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Если ОтправитьНаСервер Тогда
			МассивПараметров = Новый Массив;
			МассивПараметров.Добавить(СтруктураДанных);
			МассивПараметров.Добавить(Истина);
			
			ФонЗадание = ФоновыеЗадания.Выполнить("ЗапросыHTTP_Сервер.ОтправитьЛогиВДатаЦентр", МассивПараметров);
		КонецЕсли;
		
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

Функция ПодготовитьИнформацибОбОшибке(ТекстОшибки, Отправлено = Ложь, Важность = Неопределено) Экспорт
	
	СтруктураИнформации = Новый Структура;
	
	ВажностьОшибки = ?(ЗначениеЗаполнено(Важность), Важность, ПредопределенноеЗначение("Перечисление.КритерииОшибок.НеКритичная")); 
	СисИнфо = Новый СистемнаяИнформация;        
	
	СтруктураИнформации.Вставить("Период",ТекущаяДата());
	СтруктураИнформации.Вставить("Дата",ТекущаяДата());
	СтруктураИнформации.Вставить("УниверсальнаяДата", ТекущаяУниверсальнаяДата());
	СтруктураИнформации.Вставить("ЧасовойПояс", ЧасовойПояс());
	СтруктураИнформации.Вставить("user_id", ОбщиеПроцедурыИФункцииСервер.ПолучитьЗначениеКонстанты("user_id"));
	СтруктураИнформации.Вставить("ВерсияОС" ,СисИнфо.ВерсияОС);
	СтруктураИнформации.Вставить("ВерсияКофигурации", СисИнфо.ВерсияПриложения);
	СтруктураИнформации.Вставить("ВерсияПрограммы", Метаданные.Версия);
	СтруктураИнформации.Вставить("ОперативнаяПамять", СисИнфо.ОперативнаяПамять);
	СтруктураИнформации.Вставить("Процессор", СисИнфо.Процессор);
	СтруктураИнформации.Вставить("ТипПлатформы", Строка(СисИнфо.ТипПлатформы));
	СтруктураИнформации.Вставить("Отправлено", Отправлено);
	СтруктураИнформации.Вставить("ТекстОшибки", ТекстОшибки);
	СтруктураИнформации.Вставить("Важность", ВажностьОшибки);
	
	Возврат СтруктураИнформации;
КонецФункции

Функция ОбработатьЛогиПослеВыгрузки(Данные) Экспорт
	ХЗ = XMLЗначение(Тип("ХранилищеЗначения"), Данные);
	ТабДанных = ХЗ.Получить();
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	Для Каждого Запись Из ТабДанных Цикл
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Отправлено = Истина;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
КонецФункции
